In [33]:
import numpy as np
import pandas as pd

# Loading the Uncleaned dataset into a pandas DataFrame
df = pd.read_csv("Uncleaned.csv")

In [34]:
# Displaying first 5 rows to understand the structure of the dataset
df.head()

,Employee ID,Employee Name,Employee Position,Salary,Age,Gender,Department,Hire Date
0,178,Christopher Reilly,employee,99280,62.0,Male,Accounts,28-07-2020
1,2,Jennifer Newton,employee,66717,NaN,Male,NaN,04-11-2018
2,42,Dakota Khan,Administrator,87759,56.0,Female,Accounts,30-03-2023
3,177,Nancy Long,Techies,75973,59.0,Male,Manegement,27-06-2018
4,55,Jeffrey Miller,Techies,67856,45.0,Male,Administration,19-03-2022

In [35]:
# dataset shape 
df.shape

(208, 8)

In [36]:
# Checking for missing values in each column
missing_values=df.isnull().sum()       
print(missing_values)

Employee ID          0
Employee Name        0
Employee Position    0
Salary               3
Age                  2
Gender               1
Department           3
Hire Date            1
dtype: int64

In [37]:
# Checking column names, data types, and missing values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             205 non-null    object
 4   Age                206 non-null    float64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 13.1+ KB

In [38]:
#Data Cleaning
# Cleaning Salary column by handling textual and invalid numeric values
df['Salary'] = df['Salary'].replace("Sixty Thousand",60000)

# Converting Salary column to numeric datatype
# Invalid or non-convertible values are set to NaN
df['Salary'] = pd.to_numeric(df['Salary'],errors='coerce')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             205 non-null    float64
 4   Age                206 non-null    float64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 13.1+ KB

In [39]:
# Identifying suspicious salary values that are unrealistically low
df[df['Salary']==10]

,Employee ID,Employee Name,Employee Position,Salary,Age,Gender,Department,Hire Date
8,83,Jessica Shepherd,employee,10.0,32.0,Female,Accounts,25-10-2019

In [40]:
# Replacing invalid salary values (<=10) with NaN
df.loc[df['Salary']<=10,'Salary']=np.nan
# Imputing missing salary values using the median salary
df['Salary'] = df['Salary'].fillna(df['Salary'].median())
df.head(10)

,Employee ID,Employee Name,Employee Position,Salary,Age,Gender,Department,Hire Date
0,178,Christopher Reilly,employee,99280.0,62.0,Male,Accounts,28-07-2020
1,2,Jennifer Newton,employee,66717.0,NaN,Male,NaN,04-11-2018
2,42,Dakota Khan,Administrator,87759.0,56.0,Female,Accounts,30-03-2023
3,177,Nancy Long,Techies,75973.0,59.0,Male,Manegement,27-06-2018
4,55,Jeffrey Miller,Techies,67856.0,45.0,Male,Administration,19-03-2022
5,46,Elizabeth Tanner,Manager,89041.0,65.0,Male,Accounts,15-05-2019
6,5,Shawn Harrington,Techies,74446.0,NaN,Female,Accounts,05-12-2022
7,44,Matthew Knapp,employee,72556.0,42.0,Female,Sales,10-12-2022
8,83,Jessica Shepherd,employee,82176.0,32.0,Female,Accounts,25-10-2019
9,111,Anna Logan,Manager,65501.0,57.0,Male,Manegement,07-11-2017

In [42]:
# Verifying data types and missing values after cleaning
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                206 non-null    float64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 13.1+ KB

In [43]:
#Age
# Handling unrealistic age values in the dataset
df.loc[(df['Age']<=10) | (df['Age']>=100),'Age']=np.nan

# Imputing missing age values using median imputation to reduce the impact of outliers
df["Age"] = df["Age"].fillna(df["Age"].median()).astype(int)


# Verifying data types and missing values after cleaning
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                208 non-null    int64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 13.1+ KB

In [44]:
# Imputing missing values in Gender column using mode (most frequent category)
df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])

# Verifying data types and missing values after cleaning
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                208 non-null    int64
 5   Gender             208 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 13.1+ KB

In [45]:
# Generating descriptive statistics for the Department column
df["Department"].describe()

count            205
unique             6
top       Manegement
freq              53
Name: Department, dtype: object

In [46]:
# Analyzing frequency distribution of department categories
df["Department"].value_counts()

Department
Manegement         53
Sales              47
Administration     41
Accounts           34
Human_Resources    29
Sales&Marketing     1
Name: count, dtype: int64

In [47]:
# Correcting inconsistent department names
df["Department"] = df["Department"].replace("Manegement", "Management")
df["Department"] = df["Department"].replace("Sales&Marketing", "Sales")

# Imputing missing values in Department column using mode
df["Department"] = df["Department"].fillna(df["Department"].mode()[0])

# Verifying data types and missing values after cleaning
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                208 non-null    int64
 5   Gender             208 non-null    object
 6   Department         208 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 13.1+ KB

In [48]:
# Converting Hire Date to datetime format
df['Hire Date'] = pd.to_datetime(df['Hire Date'], errors='coerce')

# Creating a flag for invalid or missing hire dates
df['Hire Date'] = df['Hire Date'].fillna("Invalid date")

# Verifying data types and missing values after cleaning
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                208 non-null    int64
 5   Gender             208 non-null    object
 6   Department         208 non-null    object
 7   Hire Date          208 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 13.1+ KB

C:\Users\sahup\AppData\Local\Temp\ipykernel_6268\1044959072.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Hire Date'] = pd.to_datetime(df['Hire Date'], errors='coerce')

In [49]:
df.to_csv("Cleaned_file.csv",index=False)